Test2/app/controllers/home_controller.rb

SELECT COUNT(*) FROM "tasks" WHERE (user_id=1) AND (historie_id=1)
SELECT COUNT(*) FROM "histories"
SELECT "histories".* FROM "histories"
---
  def index
  	if user_signed_in?
  		@tasks_made = Task.where("user_id=#{current_user.id}").count
  		@histories_total = Historie.count
  	end
  	@historias = Historie.all