Test2/app/controllers/tasks_controller.rb

  def create
  	 Task.create(user_id: params[:user_id].to_i, historie_id: params[:histories_id].to_i, state: params[:state])
---
INSERT INTO "tasks" ("user_id", "histories_id", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["histories_id", 2], ["state", "t"], ["created_at", "2017-09-22 03:31:25.721783"], ["updated_at", "2017-09-22 03:31:25.721783"]]

  def desmarcar
  	 @task = Task.where("user_id=#{current_user.id}").where("historie_id=#{params[:histories_id]}").first
  	 unless @task.nil?
  	 	@task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE (user_id=5) AND (historie_id=2) ORDER BY "tasks"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 47]]

  def index
     @tasks_made = Task.where("user_id=#{current_user.id}").count
     @histories_total = Historie.count
     @tasks = Task.where("historie_id=#{params[:history_id]}")
     @historia = Historie.where("id=#{params[:history_id]}").first
---
SELECT COUNT(*) FROM "tasks" WHERE (user_id=1) AND (historie_id=52)
SELECT COUNT(*) FROM "histories"
SELECT  "tasks".* FROM "tasks" WHERE (user_id=1) AND (historie_id=) ORDER BY "tasks"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "histories".* FROM "histories" WHERE (historie_id=2) ORDER BY "histories"."id" DESC LIMIT ?  [["LIMIT", 1]]